УНФ_ТЕСТ/src/BusinessProcesses/КП_БизнесПроцесс/КП_БизнесПроцесс.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:BusinessProcess>
  <name>КП_БизнесПроцесс</name>
  <task>Task.КП_Задача</task>
  <attributes>
    <name>Автор</name>
    <comment>&quot;Автор&quot; для совместимости с типовыми</comment>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидПроцесса</name>
    <type>
      <types>CatalogRef.КП_ВидыПроцессов</types>
    </type>
  </attributes>
  <attributes>
    <name>ДайджестСсылокНаОбъекты</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>512</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаЗавершения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДействиеПараллельное</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИднАвтора</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИднКонтролера</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Контролер</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Наименование</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТочкаВозвратаВВышестоящийПроцесс</name>
    <comment>Используется при создании процесса из другого процесса</comment>
    <type>
      <types>CatalogRef.КП_ТочкиПроцессов</types>
    </type>
  </attributes>
  <attributes>
    <name>ХранилищеКартыПроцесса</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ХранилищеТекстаПроцесса</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ВизуальнаяСхемаСкопирована</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>UIDВМобильномКлиенте</name>
    <comment>Заполняется при создании процесса из мобильного клиента</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ОсновныеИсполнители</name>
    <attributes>
      <name>ТочкаАдресации</name>
      <type>
        <types>CatalogRef.КП_РолеваяАдресация</types>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>ОтчетИсполнителя</name>
      <type>
        <types>CatalogRef.КП_ТребуемыеРезультатыИсполнителей</types>
      </type>
    </attributes>
    <attributes>
      <name>СрокВыполненияТекст</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИндивидуальныйТекстЗадания</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>1000</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИндивидуальноеНаименованиеЗадания</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>1000</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СрокВыполненияЧасов</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>4</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВидНаправленияПараллельное</name>
      <comment>1 - параллельное, 0 - последовательное</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>1</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НеИспользоватьГрафикРаботы</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ИднИсполнителя</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СрокВыполненияДатаВремя</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СетьМаршрутныхТочек</name>
    <attributes>
      <name>ТочкаВыход</name>
      <type>
        <types>CatalogRef.КП_ТочкиПроцессов</types>
      </type>
    </attributes>
    <attributes>
      <name>ТочкаВход</name>
      <type>
        <types>CatalogRef.КП_ТочкиПроцессов</types>
      </type>
    </attributes>
    <attributes>
      <name>УсловныйПереход</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ЗначениеРеквизита</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИмяЛинииНаСхеме</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>УсловиеПерехода</name>
      <comment>для точки Условия - 0 (нет), 1 (да); для точки ВыборВарианта - номер варианта</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>УсловиеПереходаНаименование</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПроектыБизнесПроцесса</name>
    <attributes>
      <name>Проект</name>
      <type>
        <types>CatalogRef.Проекты</types>
      </type>
    </attributes>
    <attributes>
      <name>Примечание</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>255</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:BusinessProcess>

УНФ_ТЕСТ/src/InformationRegisters/КП_СсылкиПроцессов/КП_СсылкиПроцессов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>КП_СсылкиПроцессов</name>
  <attributes>
    <name>Примечание</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>БизнесПроцесс</name>
    <type>
      <types>BusinessProcessRef.КП_БизнесПроцесс</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Объект</name>
    <type>
      <types>DocumentRef</types>
      <types>CatalogRef</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

УНФ_ТЕСТ/src/BusinessProcesses/КП_БизнесПроцесс/ObjectModule.bsl
#Область ОбработчикиСобытий

Процедура ПриЗаписи(Отказ)
	
	Если ПометкаУдаления Тогда
		КП_СхемаКБПСервер.ПометитьНаУдалениеТочки(Ссылка);
	КонецЕсли;	
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ)
	
	Если НЕ ПометкаУдаления Тогда
		//сформируем дайджест ссылок
		
		СтрокаДайджестаСсылок="";
		
		УстановитьПривилегированныйРежим(Истина);
		
		Запрос=Новый Запрос("ВЫБРАТЬ
		                    |	КП_СсылкиПроцессов.Объект КАК СсылкаНаПрикрепленныйОбъект
		                    |ИЗ
		                    |	РегистрСведений.КП_СсылкиПроцессов КАК КП_СсылкиПроцессов
		                    |ГДЕ
		                    |	КП_СсылкиПроцессов.БизнесПроцесс = &БизнесПроцесс");
							
		Запрос.УстановитьПараметр("БизнесПроцесс", Ссылка);
		Выборка=Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.Прямой);
		Пока Выборка.Следующий() Цикл
			СсылкаНаПрикрепленныйОбъект=Выборка.СсылкаНаПрикрепленныйОбъект;
			
			ПредставлениеОбъекта=КП_ОбщееСервер.ПолучитьПредставлениеОбъекта(СсылкаНаПрикрепленныйОбъект);

			СтрокаДайджестаСсылок=СтрокаДайджестаСсылок+?(СтрокаДайджестаСсылок="", "", ", ")+ПредставлениеОбъекта;
			Если СтрДлина(СтрокаДайджестаСсылок)>512 Тогда
				СтрокаДайджестаСсылок=Лев(СтрокаДайджестаСсылок, 509)+"...";
				Прервать;
			КонецЕсли;
			
		КонецЦикла;
		
		ДайджестСсылокНаОбъекты=СтрокаДайджестаСсылок;
		
	КонецЕсли;
		
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	Если ТипЗнч(ДанныеЗаполнения)=Тип("Структура") Тогда
		ДанныеЗаполнения.Свойство("ВидПроцесса", ВидПроцесса);		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура СхемаКБПВыполненаПроверкаУсловия(ТочкаМаршрутаБизнесПроцесса, Результат)
	//проверим, выполнена ли схема КБП, схема может быть выполнена сразу после запуска (если в ней нет задач)
	
	//Если Ссылка.Завершен Тогда
	//	Результат=Истина;
	//Иначе
		Результат=КП_Процессы.СхемаКБПЗавершена(Ссылка);
	//КонецЕсли;
	
КонецПроцедуры

// Процедура ЗаполнитьНаборыЗначенийДоступа по свойствам объекта заполняет наборы значений доступа
// в таблице с полями:
//    НомерНабора     - Число                                     (необязательно, если набор один),
//    ВидДоступа      - ПланВидовХарактеристикСсылка.ВидыДоступа, (обязательно),
//    ЗначениеДоступа - Неопределено, СправочникСсылка или др.    (обязательно),
//    Чтение          - Булево (необязательно, если набор для всех прав) устанавливается для одной строки набора,
//    Добавление      - Булево (необязательно, если набор для всех прав) устанавливается для одной строки набора,
//    Изменение       - Булево (необязательно, если набор для всех прав) устанавливается для одной строки набора,
//    Удаление        - Булево (необязательно, если набор для всех прав) устанавливается для одной строки набора,
//
//  Вызывается из процедуры УправлениеДоступом.ЗаписатьНаборыЗначенийДоступа(),
// если объект зарегистрирован в "ПодпискаНаСобытие.ЗаписатьНаборыЗначенийДоступа" и
// из таких же процедур объектов, у которых наборы значений доступа зависят от наборов этого
// объекта (в этом случае объект зарегистрирован в "ПодпискаНаСобытие.ЗаписатьЗависимыеНаборыЗначенийДоступа").
//
// Параметры:
//  Таблица      - ТабличнаяЧасть,
//                 РегистрСведенийНаборЗаписей.НаборыЗначенийДоступа,
//                 ТаблицаЗначений, возвращаемая УправлениеДоступом.ТаблицаНаборыЗначенийДоступа().
Процедура ЗаполнитьНаборыЗначенийДоступа(Таблица) Экспорт
	
	ТестовыйРежим=Истина;
	
	// Логика ограничения прав
	//     Чтения, Добавления, Изменения, Удаления:
	//         (Автор ИЛИ КонтролерКБП) И Контакт
	
	// Чтение, Добавление, Изменение: 
	//		набор №0.
	
	НомерНабора=0;
	
	Строка=Таблица.Добавить();
	Строка.ВидДоступа=ПланыВидовХарактеристик.ВидыДоступа.КП_ВидыПроцессов;
	Строка.НомерНабора=НомерНабора;
	Строка.ЗначениеДоступа=Ссылка.ВидПроцесса;
	Строка.Чтение=Истина;
	Строка.Добавление=Истина;
	Строка.Изменение=Истина;
	Строка.Удаление=Истина;
	
	НомерНабора=НомерНабора+1;
	Строка=Таблица.Добавить();
	Строка.ВидДоступа=ПланыВидовХарактеристик.ВидыДоступа.Пользователи;
	Строка.НомерНабора=НомерНабора;
	Строка.ЗначениеДоступа=Ссылка.Автор;
	Строка.Чтение=Истина;
	Строка.Добавление=Истина;
	Строка.Изменение=Истина;
	Строка.Удаление=Истина;
	
	КонтролерПроцесса=Ссылка.Контролер;
	Если ЗначениеЗаполнено(КонтролерПроцесса) И КонтролерПроцесса<>Ссылка.Автор Тогда
		НомерНабора=НомерНабора+1;
		Строка=Таблица.Добавить();
		Строка.ВидДоступа=ПланыВидовХарактеристик.ВидыДоступа.Пользователи;
		Строка.НомерНабора=НомерНабора;
		Строка.ЗначениеДоступа=КонтролерПроцесса;
		Строка.Чтение=Истина;
		Строка.Добавление=Истина;
		Строка.Изменение=Истина;
		Строка.Удаление=Ложь;		
	КонецЕсли;
	
	//добавим исполнителей
	
	СписокИсполнителей=КП_Процессы.ПолучитьСписокВсехИсполнителейПроцесса(Ссылка);
	
	Для Каждого ЭлементИсполнитель Из СписокИсполнителей Цикл
		
		ТекущийИсполнитель=ЭлементИсполнитель.Значение;
		//добавляем новую строку в таблицу
		НомерНабора=НомерНабора+1;
		
		Строка=Таблица.Добавить();
		Строка.ВидДоступа      = ПланыВидовХарактеристик.ВидыДоступа.Пользователи;
		Строка.НомерНабора     = НомерНабора;
		Строка.ЗначениеДоступа = ТекущийИсполнитель;
		Строка.Чтение=Истина;
		Строка.Добавление=Ложь;
		Строка.Изменение=Истина;
		Строка.Удаление=Ложь;

	КонецЦикла;
	
	//Если НаборыУчастников.Количество() > 0 Тогда
	//	// добавление в таблицу Таблица таблицы НаборУчастников
	//	// с умножение наборов таблицы на наборы участников по всем правам.
	//	
	//	УправлениеДоступом.ДобавитьНаборыЗначенийДоступа(Таблица, НаборыУчастников, Истина);
	//	
	//КонецЕсли;
	
КонецПроцедуры // ЗаполнитьНаборыЗначенийДоступа()

Процедура ЗавершениеПриЗавершении(ТочкаМаршрутаБизнесПроцесса, Отказ)
	ДатаЗавершения=ТекущаяДата();
	
КонецПроцедуры

Процедура ВыполнениеКорпоративногоПроцессаПриСозданииЗадач(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, Отказ)
	КП_Процессы.ОбработатьМаршрутКБП(Ссылка, Ссылка);

КонецПроцедуры

#КонецОбласти
